import "../../assets/Pages.css";

export default function AboutUsPage() {
  return (
    <div className="page-container">
      <h1>من نحن</h1>

      <p>
        نحن منصة متخصصة في تقديم منتجات صديقة للبيئة وجودة عالية تهدف إلى
        دعم نمط حياة صحي ومستدام.
      </p>

      <p>
        نعمل على توفير تجربة تسوق سهلة وآمنة تجمع بين المنتجات الطبيعية
        والعلامات التجارية الموثوقة.
      </p>

      <p>
        هدفنا هو نشر الوعي بالاستهلاك المسؤول وتوفير بدائل أفضل للحياة اليومية.
      </p>
    </div>
  );
}